app/controllers/students_controller.rb

	def update
	  @student = Student.find(params[:id])
	  @student.update(student_params(:last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Vicky"], ["updated_at", "2019-05-28 10:07:08.534379"], ["id", 5]]